window.FILE_DB = {
    "1秋": {
        type: "folder",
        desc: "大一秋季学期课内资料汇总",
        children: {
            "数学分析B1": {
                type: "folder",
                desc: "下辈子一定好好学习数学分析",
                children: {
                    "数学分析讲义 (第一册) (程艺 陈卿 李平).pdf": {
                        desc: "数学分析B1教材",
                        url: "files/1秋/数学分析B1/数学分析讲义 (第一册) (程艺 陈卿 李平).pdf"
                    },
                    "数学分析B1笔记.pdf": {
                        desc: "数分笔记, 可惜期中之后沦为纯抄书, 没带脑子, 所以期末惨败",
                        url: "files/1秋/数学分析B1/数学分析B1笔记.pdf"
                    },
                    "数学分析B1补充习题笔记.pdf": {
                        desc: "数分某些习题, 历年试卷某些题目的笔记, 应该无用, 仅存档",
                        url: "files/1秋/数学分析B1/数学分析B1补充习题笔记.pdf"
                    },
                    "数学分析历年试题.pdf": {
                        desc: "25-26期末+数学分析历年试题(2024版, 来自pksq)",
                        url: "files/1秋/数学分析B1/数学分析历年试题.pdf"
                    },
                    "数学分析期末复习讲座.pdf": {
                        desc: "期末复习讲座",
                        url: "files/1秋/数学分析B1/数学分析期末复习讲座.pdf"
                    },
                    "微积分学习指导(上册).pdf": {
                        desc: "数学分析推荐教辅",
                        url: "files/1秋/数学分析B1/微积分学习指导(上册).pdf"
                    },
                    "微积分学习指导(下册).pdf": {
                        desc: "数学分析推荐教辅",
                        url: "files/1秋/数学分析B1/微积分学习指导(下册).pdf"
                    }
                }
            },
            "线性代数B1": {
                type: "folder",
                desc: "在一秋选择线代是正确的",
                children: {
                    "线性代数B1讲义.pdf": {
                        desc: "USTC线性代数B1教材",
                        url: "files/1秋/线性代数B1/线性代数B1讲义.pdf"
                    },
                    "线性代数B1笔记.pdf": {
                        desc: "参考USTC&同济教材。带着脑子抄书是正确的。建议仅参考里面的补充习题, 可能含有笔误",
                        url: "files/1秋/线性代数B1/线性代数B1笔记.pdf"
                    },
                    "作业&习题课.zip": {
                        desc: "课后作业&习题课部分讲义, 应该没什么用了, 只是存档",
                        url: "files/1秋/线性代数B1/作业&习题课.zip"
                    },
                    "线性代数B1历年试题.pdf": {
                        desc: "截止到24-25年的历年试题, 来自pksq",
                        url: "files/1秋/线性代数B1/线性代数B1历年试题.pdf"
                    },
                    "线性代数(同济).pdf": {
                        desc: "同济大学线性代数教材, 对比USTC教材胜在更浅显与层次清晰",
                        url: "files/1秋/线性代数B1/线性代数(同济).pdf"
                    },
                    "线性代数学习辅导与习题全解(同济).pdf": {
                        desc: "同济大学线性代数教材辅导讲义",
                        url: "files/1秋/线性代数B1/线性代数学习辅导与习题全解(同济).pdf"
                    }
                }
            },
            "计算机程序设计": {
                type: "folder",
                desc: "学习C语言是对的吗?",
                children: {
                    "程设总复习.pdf": {
                        desc: "期末复习文件",
                        url: "files/1秋/计算机程序设计/程设总复习.pdf"
                    },
                    "程设期末模拟测试题.pdf": {
                        desc: "四份期末模拟测试题",
                        url: "files/1秋/计算机程序设计/程设期末模拟测试题.pdf"
                    },
                    "程设复习笔记.pdf": {
                        desc: "综合测试题错题&笔记整理, 仅供参考, 什么时候取消程设笔试啊",
                        url: "files/1秋/计算机程序设计/程设复习笔记.pdf"
                    }
                }
            },
            "力学A": {
                type: "folder",
                desc: "下辈子再也不选力学A了",
                children: {
                    "力学期末复习笔记.pdf": {
                        desc: "期末复习笔记, 但是期末挂科的人的笔记会有用吗? 仅存档",
                        url: "files/1秋/力学A/力学期末复习笔记.pdf"
                    },
                    "力学大作业汇报终稿.pptx": {
                        desc: "小组作业",
                        url: "files/1秋/力学A/力学大作业汇报终稿.pptx"
                    },
                    "交叉学科基础物理教程力学.pdf": {
                        desc: "教材",
                        url: "files/1秋/力学A/交叉学科基础物理教程力学.pdf"
                    },
                    "交叉学科基础物理教程力学习题解答.pdf": {
                        desc: "教材习题答案, 有部分笔误",
                        url: "files/1秋/力学A/交叉学科基础物理教程力学习题解答.pdf"
                    },
                    "力学习题及解答-舒幼生, 北大版, 2005.pdf": {
                        desc: "舒幼生力学, 推荐教辅",
                        url: "files/1秋/力学A/力学习题及解答-舒幼生, 北大版, 2005.pdf"
                    },
                    "舒幼生-物理学难题集萃.pdf": {
                        desc: "难题集萃, 推荐教辅",
                        url: "files/1秋/力学A/舒幼生-物理学难题集萃.pdf"
                    },
                    "物理学难题集萃难度分级表.xlsx": {
                        desc: "难题集萃使用指南",
                        url: "files/1秋/力学A/物理学难题集萃难度分级表.xlsx"
                    }
                }
            },
            "网安导论": {
                type: "folder",
                desc: "网络空间安全导论",
                children: {
                    "网络空间安全导论 (刘建伟主编) .pdf": {
                        desc: "课程教材",
                        url: "files/1秋/网安导论/网络空间安全导论 (刘建伟主编) .pdf"
                    },
                    "网安导论课后习题参考答案.docx": {
                        desc: "教材习题参考答案, 非官方解答",
                        url: "files/1秋/网安导论/网安导论课后习题参考答案.docx"
                    },
                    "网安导论英文缩写对照表.xlsx": {
                        desc: "来自pksq, 期末考试考点之一",
                        url: "files/1秋/网安导论/网安导论英文缩写对照表.xlsx"
                    }
                }
            },
            "习概&思政": {
                type: "folder",
                desc: "文科能不能414",
                children: {
                    "习概知识总结.pdf": {
                        desc: "习概知识点",
                        url: "files/1秋/习概&思政/习概知识总结.pdf"
                    },
                    "习概课本索引.pdf": {
                        desc: "习概知识点索引",
                        url: "files/1秋/习概&思政/习概课本索引.pdf"
                    },
                    "思政知识总结.pdf": {
                        desc: "思政知识点",
                        url: "files/1秋/习概&思政/思政知识总结.pdf"
                    },
                    "思政课本索引.pdf": {
                        desc: "思政知识点索引",
                        url: "files/1秋/习概&思政/思政课本索引.pdf"
                    },
                    "实现祖国统一.pptx": {
                        desc: "习概小组演讲ppt",
                        url: "files/1秋/习概&思政/实现祖国统一.pptx"
                    },
                    "我眼中的马克思.pptx": {
                        desc: "思政知小组演讲ppt",
                        url: "files/1秋/习概&思政/我眼中的马克思.pptx"
                    }
                }
            },
            "其他资料": {
                type: "folder",
                desc: "包含其他1秋的资料",
                children: {
                    "班级事务": {
                        type: "folder",
                        desc: "做一个负责任的班长",
                        children: {
                            "2025.11.30秋游": {
                                type: "folder",
                                desc: "团建存档",
                                children: {
                                    "11月30日团日活动计划书.docx": {
                                        desc: "轰趴计划书?",
                                        url: "files/1秋/其他资料/班级事务/2025.11.30秋游/11月30日团日活动计划书.docx"
                                    },
                                    "11月30日心理活动计划书.docx": {
                                        desc: "心理活动计划书?",
                                        url: "files/1秋/其他资料/班级事务/2025.11.30秋游/11月30日心理活动计划书.docx"
                                    },
                                    "活动新闻稿《同心同行同乐》.docx": {
                                        desc: "活动新闻稿",
                                        url: "files/1秋/其他资料/班级事务/2025.11.30秋游/活动新闻稿《同心同行同乐》.docx"
                                    },
                                    "名单-11.30秋游意向统计.xlsx": {
                                        desc: "参与名单初版",
                                        url: "files/1秋/其他资料/班级事务/2025.11.30秋游/名单-11.30秋游意向统计.xlsx"
                                    }
                                }
                            },
                            "25级少院5班25秋领书.xlsx": {
                                desc: "1秋领书表格, 这适合放上来吗? 大抵无所谓吧",
                                url: "files/1秋/其他资料/班级事务/25级少院5班25秋领书.xlsx"
                            },
                            "2025年学生运动会秩序册.pdf": {
                                desc: "大抵无人在意的运动会秩序册",
                                url: "files/1秋/其他资料/班级事务/2025年学生运动会秩序册.pdf"
                            },
                            "中国科学技术大学第五十六届学生体育运动大会竞赛规程.docx": {
                                desc: "大抵无人在意的运动会竞赛规程",
                                url: "files/1秋/其他资料/班级事务/中国科学技术大学第五十六届学生体育运动大会竞赛规程.docx"
                            },
                            "纪念杨振宁先生暨科学家精神学习会.pptx": {
                                desc: "纪念杨振宁先生暨科学家精神学习会ppt",
                                url: "files/1秋/其他资料/班级事务/纪念杨振宁先生暨科学家精神学习会.pptx"
                            },
                            "竞选班长.pptx": {
                                desc: "我的班长竞选ppt",
                                url: "files/1秋/其他资料/班级事务/竞选班长.pptx"
                            }
                        }
                    },
                    "学生骨干培训": {
                        type: "folder",
                        desc: "“大骨班”",
                        children: {
                            "第二十六期学生骨干培训班暨团校第三十二期培训班学员公示名单.xls": {
                                desc: "“大骨班”名单",
                                url: "files/1秋/其他资料/第二十六期学生骨干培训班暨团校第三十二期培训班学员公示名单.xls"
                            },
                            "学生骨干培训心得体会.docx": {
                                desc: "纯AI, 仅存档",
                                url: "files/1秋/其他资料/学生骨干培训心得体会.docx"
                            }
                        }
                    },
                    "Internet Slang.pptx": {
                        desc: "英语期末演讲ppt",
                        url: "files/1秋/其他资料/Internet Slang.pptx"
                    }
                }
            }
        }
    },
    "1春": {
        type: "folder",
        desc: "大一秋季学期课内资料汇总",
        children: {
            "数学分析B2": {
                type: "folder",
                desc: "rt",
                children: {
                    "数学分析讲义(第二册)(程艺 陈卿 李平).pdf": {
                        desc: "数学分析B2教材",
                        url: "files/1春/数学分析B2/数学分析讲义(第二册)(程艺 陈卿 李平).pdf"
                    }
                }
            },
            "数据结构及其算法": {
                type: "folder",
                desc: "rt",
                children: {
                    "数据结构及应用算法 2版 (袁平波，顾为兵，尹东编著).pdf": {
                        desc: "数据结构及其算法教材",
                        url: "files/1春/数据结构及其算法/数据结构及应用算法 2版 (袁平波，顾为兵，尹东编著).pdf"
                    }
                }
            }
        }
    }
};